# ReverseIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPBuildingConstructionSet..::..ReverseIterator Method
MEPBuildingConstructionSet Class See Also
---
Retrieve a backward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual MEPBuildingConstructionSetIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As MEPBuildingConstructionSetIterator
```

Visual C++
---
```text
public:
virtual MEPBuildingConstructionSetIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the set.
# See Also
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace